export default function declaration13 (company, eik, egn, manager) {
    let organ="";

    if (company.includes('АД')) {
        organ='представител';
    } else if (company.includes('СДРУЖЕНИЕ')){
        organ='представител';
    } else {
        organ='управител';
    }
    
    return `                                                                       ДЕКЛАРАЦИЯ
    по чл. 13, ал. 4 от Закона за търговския регистър и регистъра на юридическите лица с нестопанска цел
    Долуподписаният ${manager}, с ЕГН: ${egn} в качеството си на ${organ} на ${company}, ЕИК:${eik}, с настоящото
                                                                        ДЕКЛАРИРАМ:  
    Истинността на заявените от мен обстоятелства и приемането на предоставените за обявяване актове.
    Известно ми е, че за деклариране на неверни данни нося наказателна отговорност по чл. 313 от Наказателния кодекс.

                                                                        Декларатор: 

                                                                ____________________________
                                                        /${manager}/`
};