export default function declarationGFO (company, eik, egn, manager) {
    let organ="";

    if (company.includes('ЕООД')) {
        organ='Едноличния собственик на капитала';
    } else {
        organ='общото събрание на съдружниците или акционерите'
    }

    console.log(organ);

    const result = `                                                                       ДЕКЛАРАЦИЯ
    по чл. 62а, ал. 2, т. 2 от Наредба № 1 от 2007 г. за водене, съхраняване и достъп до търговския регистър и до регистъра на юридическите лица с нестопанска цел

    Долуподписаният ${manager} с ЕГН: ${egn}, в качеството си на законен представител на ${company} с ЕИК:${eik},
    на основание чл. 62а, ал. 2, т. 2 от Наредба № 1 от 2007 г. за водене, съхраняване и достъп до търговския регистър и до регистъра на юридическите лица с нестопанска цел във връзка с чл. 38, ал. 1, т. 1 и 2 от Закона за счетоводството
                                                                    ДЕКЛАРИРАМ, ЧЕ:
    Представляваното от мен предприятие е:
    1. микропредприятие по смисъла на чл. 19, ал. 2 от Закона за счетоводството;
    2. малко предприятие по смисъла на чл. 19, ал. 3 от Закона за счетоводството;
    3. средно предприятие по смисъла на чл. 19, ал. 4 от Закона за счетоводството.

    Представеният за обявяване годишен финансов отчет и годишен доклад за дейността за 2020 г. е приет от ${organ} или от съответния орган по чл. 38, ал. 1 от Закона за счетоводството.
    При определяне на категорията на предприятието са спазени изискванията на чл. 20 от Закона за счетоводството.
    Известно ми е, че за декларирани от мен неверни данни нося отговорност по чл. 313 от Наказателния кодекс.

    гр. София
    дата: .................                                                                                                         Декларатор:...................
                                                                                                        /${manager}/`
                                                                                                                                            

    return result
};


